[
    {
        "boid": "EP23-11-1d",
        "bo": "EP23-11-1d",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3000",
            "设计完钻层位": "珠海组",
            "目标区": "",
            "设计目的层": "珠江组-珠海组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "斜井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                113.698433,
                20.4323463
            ]
        }
    },
    {
        "boid": "HZ19-8-1",
        "bo": "HZ19-8-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3350",
            "设计完钻层位": "珠海组",
            "目标区": "",
            "设计目的层": "韩江组-珠江组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.133842,
                21.31774
            ]
        }
    },
    {
        "boid": "HZ21-7-1",
        "bo": "HZ21-7-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3600",
            "设计完钻层位": "珠海组",
            "目标区": "",
            "设计目的层": "珠江组下段",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.428223,
                21.3928242,
                null,
                null,
                null,
                null,
                null,
                null,
                null
            ]
        }
    },
    {
        "boid": "HZ25-8-6",
        "bo": "HZ25-8-6",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2800",
            "设计完钻层位": "珠海组",
            "目标区": "",
            "设计目的层": "珠江组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "评价井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.113,
                21.1981773
            ]
        }
    },
    {
        "boid": "HZ26-2E-1",
        "bo": "HZ26-2E-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2670",
            "设计完钻层位": "珠江组",
            "目标区": "",
            "设计目的层": "珠江组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {}
    },
    {
        "boid": "HZ27-4-3",
        "bo": "HZ27-4-3",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3370",
            "设计完钻层位": "基底",
            "目标区": "",
            "设计目的层": "珠江组下段-珠海组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "评价井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.4104,
                21.2515755
            ]
        }
    },
    {
        "boid": "HZ27-4-3Sa",
        "bo": "HZ27-4-3Sa",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3560",
            "设计完钻层位": "恩平组",
            "目标区": "",
            "设计目的层": "恩平组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "侧钻井",
            "井别": "探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.4104,
                21.2515755
            ]
        }
    },
    {
        "boid": "LF13-1N-1",
        "bo": "LF13-1N-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3300",
            "设计完钻层位": "文昌组",
            "目标区": "",
            "设计目的层": "珠海组-文昌组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                116.180138,
                21.6231918
            ]
        }
    },
    {
        "boid": "LF14-8-1d",
        "bo": "LF14-8-1d",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4182",
            "设计完钻层位": "下文章组",
            "目标区": "",
            "设计目的层": "恩平组、上文昌组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "斜井",
            "井别": "初探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                116.290924,
                21.65793
            ]
        }
    },
    {
        "boid": "LF8-1S-1d",
        "bo": "LF8-1S-1d",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4180",
            "设计完钻层位": "文昌组",
            "目标区": "",
            "设计目的层": "恩平组、上文昌组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "斜井",
            "井别": "评价井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                116.289642,
                21.66163
            ]
        }
    },
    {
        "boid": "LH28-1-1",
        "bo": "LH28-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4326",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组下段、珠海组上段",
            "完钻深度": "4050",
            "完钻层位": "珠海组",
            "开钻日期": "2014/6/12 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "563.5",
            "井况": "气层井",
            "完钻日期": "2014/7/4 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.528931,
                20.2521763
            ]
        }
    },
    {
        "boid": "LH28-2-1",
        "bo": "LH28-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3076",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要：珠江组下段ZJ210深水重力流沉积砂岩体、ZJ110陆架三角洲前缘沉积砂岩体",
            "完钻深度": "3350",
            "完钻层位": "前古近系",
            "开钻日期": "2014/7/28 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "653",
            "井况": "油气层井",
            "完钻日期": "2014/8/11 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.585434,
                20.19262,
                null,
                null,
                null,
                null,
                null,
                null,
                null,
                null
            ]
        }
    },
    {
        "boid": "LH28-2-2",
        "bo": "LH28-2-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3190",
            "设计完钻层位": "前古近系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3106",
            "完钻层位": "珠海组",
            "开钻日期": "2014/9/1 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "评价井",
            "水深": "705.5",
            "井况": "气层井",
            "完钻日期": "2014/9/26 0:00:00"
        },
        "location": {}
    },
    {
        "boid": "LH28-4-1",
        "bo": "LH28-4-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3676",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要目的层珠江组T50下部砂岩与珠海组T62砂岩储层",
            "完钻深度": "3610",
            "完钻层位": "珠海组",
            "开钻日期": "2013/10/11 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "560",
            "井况": "气层井",
            "完钻日期": "2013/11/26 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.6483,
                20.3382816
            ]
        }
    },
    {
        "boid": "LH29-1-1",
        "bo": "LH29-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3331",
            "设计完钻层位": "前古近系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组，珠海组",
            "完钻深度": "3331",
            "完钻层位": "前古近系",
            "开钻日期": "2009/12/29 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "723.2",
            "井况": "油气流井",
            "完钻日期": "2010/1/20 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.697273,
                20.1936855
            ]
        }
    },
    {
        "boid": "LH29-1-2",
        "bo": "LH29-1-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2961",
            "设计完钻层位": "前古近系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组，珠海组",
            "完钻深度": "2961",
            "完钻层位": "前古近系",
            "开钻日期": "2010/4/15 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "评价井",
            "水深": "764.84",
            "井况": "油气流井",
            "完钻日期": "2010/5/2 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.71479,
                20.1746311
            ]
        }
    },
    {
        "boid": "LH29-1-3",
        "bo": "LH29-1-3",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2876",
            "设计完钻层位": "恩平组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "2900",
            "完钻层位": "珠海组",
            "开钻日期": "2010/9/19 0:00:00",
            "作业方式": "合作",
            "井型": "直井",
            "井别": "评价井",
            "水深": "682.44",
            "井况": "油气层井",
            "完钻日期": "2010/10/4 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.686874,
                20.2218723
            ]
        }
    },
    {
        "boid": "LH29-1-4",
        "bo": "LH29-1-4",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3231",
            "设计完钻层位": "恩平组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3175",
            "完钻层位": "恩平组",
            "开钻日期": "2011/3/20 0:00:00",
            "作业方式": "合作（29/26）",
            "井型": "直井",
            "井别": "评价井",
            "水深": "676",
            "井况": "",
            "完钻日期": "2011/4/16 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.696625,
                20.2334328
            ]
        }
    },
    {
        "boid": "LH29-2-1",
        "bo": "LH29-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3230",
            "设计完钻层位": "恩平/文昌组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组下段，珠海组",
            "完钻深度": "3230",
            "完钻层位": "恩平组",
            "开钻日期": "2012/3/6 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "753.25",
            "井况": "气层井",
            "完钻日期": "2012/4/6 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.837509,
                20.2355556
            ]
        }
    },
    {
        "boid": "LH29-2-2",
        "bo": "LH29-2-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2710",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "2710",
            "完钻层位": "珠海组",
            "开钻日期": "2013/4/30 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "评价井",
            "水深": "741.75",
            "井况": "显示井",
            "完钻日期": "2013/5/21 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.799545,
                20.2264462
            ]
        }
    },
    {
        "boid": "LH29-4-1",
        "bo": "LH29-4-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4326",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组下段～珠海组砂岩",
            "完钻深度": "4141",
            "完钻层位": "珠海组",
            "开钻日期": "2014/3/3 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "624.38",
            "井况": "气层井",
            "完钻日期": "2014/4/14 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.707611,
                20.2957439
            ]
        }
    },
    {
        "boid": "LH30-1-1",
        "bo": "LH30-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2166",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要目的层珠江组下段陆坡重力流水道—扇朵叶体复合砂岩ZJ220和ZJ230",
            "完钻深度": "2166",
            "完钻层位": "珠海组",
            "开钻日期": "2014/5/12 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "749",
            "井况": "无显示井",
            "完钻日期": "2014/5/28 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.920547,
                20.273325
            ]
        }
    },
    {
        "boid": "LH32-1-1",
        "bo": "LH32-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4291",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "",
            "完钻深度": "4291",
            "完钻层位": "珠海组",
            "开钻日期": "2011/8/19 0:00:00",
            "作业方式": "合作（29/26）",
            "井型": "直井",
            "井别": "预探井",
            "水深": "704.79",
            "井况": "气层井",
            "完钻日期": "2011/9/14 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.257637,
                20.0925522,
                null,
                null,
                null,
                null,
                null,
                null
            ]
        }
    },
    {
        "boid": "LH32-2-1",
        "bo": "LH32-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3952",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组/珠海组",
            "完钻深度": "4080.8",
            "完钻层位": "珠海组",
            "开钻日期": "2014/10/25 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "682.62",
            "井况": "油气层井",
            "完钻日期": "2014/11/22 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.27433,
                20.1045284
            ]
        }
    },
    {
        "boid": "LH33-1-1",
        "bo": "LH33-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3426",
            "设计完钻层位": "珠江组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3426",
            "完钻层位": "珠江组",
            "开钻日期": "2013/6/11 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "599.7",
            "井况": "气层井",
            "完钻日期": "2013/7/13 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.4018,
                20.1645412
            ]
        }
    },
    {
        "boid": "LH34-2-1",
        "bo": "LH34-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3611",
            "设计完钻层位": "前第三系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "3449",
            "完钻层位": "珠海组",
            "开钻日期": "2009/9/1 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1114.67",
            "井况": "油气流井",
            "完钻日期": "2009/11/9 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.582954,
                20.0455322
            ]
        }
    },
    {
        "boid": "LH34-2-2",
        "bo": "LH34-2-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3851",
            "设计完钻层位": "前古近系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "3838",
            "完钻层位": "前古近系",
            "开钻日期": "2010/2/8 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1180.5",
            "井况": "油气流井",
            "完钻日期": "2010/2/23 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.616982,
                20.06107
            ]
        }
    },
    {
        "boid": "LH34-3-1",
        "bo": "LH34-3-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3481",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3763",
            "完钻层位": "前第三系",
            "开钻日期": "2010/6/18 0:00:00",
            "作业方式": "合作（29/26）",
            "井型": "直井",
            "井别": "预探井",
            "水深": "905.6",
            "井况": "气层井",
            "完钻日期": "2010/7/1 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.531036,
                20.1178131
            ]
        }
    },
    {
        "boid": "LH34-6-1",
        "bo": "LH34-6-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4000",
            "设计完钻层位": "前第三系",
            "目标区": "",
            "设计目的层": "珠海组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.54081,
                20.0534878
            ]
        }
    },
    {
        "boid": "LW2-1-1",
        "bo": "LW2-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4450",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组下段SQ21_lobe1（3965.0～4115.0m)",
            "完钻深度": "4550",
            "完钻层位": "珠海组",
            "开钻日期": "2013/8/19 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1516.6",
            "井况": "显示井",
            "完钻日期": "2013/10/14 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.174683,
                19.8134727
            ]
        }
    },
    {
        "boid": "LW3-1-1",
        "bo": "LW3-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4094",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "3843",
            "完钻层位": "珠海组",
            "开钻日期": "2006/4/27 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1480",
            "井况": "气层井",
            "完钻日期": "2006/6/12 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.415123,
                19.9120617
            ]
        }
    },
    {
        "boid": "LW3-1-2",
        "bo": "LW3-1-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3918",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组，珠海组",
            "完钻深度": "3918",
            "完钻层位": "珠海组",
            "开钻日期": "2008/11/20 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1344.6",
            "井况": "油气流井",
            "完钻日期": "2009/1/19 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.404877,
                19.951519
            ]
        }
    },
    {
        "boid": "LW3-1-3",
        "bo": "LW3-1-3",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3715",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠海组、珠江组",
            "完钻深度": "3698.5",
            "完钻层位": "珠海组",
            "开钻日期": "2009/3/7 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1454.6",
            "井况": "气流井",
            "完钻日期": "2009/4/7 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.401947,
                19.9116611
            ]
        }
    },
    {
        "boid": "LW3-1-4",
        "bo": "LW3-1-4",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3401",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3397",
            "完钻层位": "珠海组",
            "开钻日期": "2009/7/12 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1332.6",
            "井况": "气流井",
            "完钻日期": "2009/8/1 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.449013,
                19.9427738
            ]
        }
    },
    {
        "boid": "LW3-2-1",
        "bo": "LW3-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4020",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要珠江下段sand1，次要珠海组sand2、sand3、sand4",
            "完钻深度": "4228",
            "完钻层位": "珠海组",
            "开钻日期": "2013/6/5 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1275.5",
            "井况": "气层井",
            "完钻日期": "2013/7/14 0:00:00"
        },
        "location": {}
    },
    {
        "boid": "LW3-2-2",
        "bo": "LW3-2-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3626",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要珠江下段SQ21_sand1，次要珠海组SQ23.8砂岩",
            "完钻深度": "3702",
            "完钻层位": "珠海组",
            "开钻日期": "2013/10/28 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1289",
            "井况": "气层井",
            "完钻日期": "2015/7/12 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.428421,
                19.970747
            ]
        }
    },
    {
        "boid": "LW3-2-3",
        "bo": "LW3-2-3",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3626",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "主要珠江下段SQ21_sand1，次要珠海组SQ23.8砂岩",
            "完钻深度": "3726",
            "完钻层位": "珠海组",
            "开钻日期": "2015/7/23 0:00:00",
            "作业方式": "自营",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1368",
            "井况": "气层井",
            "完钻日期": "2015/8/9 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.519463,
                19.975872
            ]
        }
    },
    {
        "boid": "LW3-3-1",
        "bo": "LW3-3-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2531",
            "设计完钻层位": "韩江组",
            "目标区": "白云凹陷",
            "设计目的层": "韩江组",
            "完钻深度": "2431",
            "完钻层位": "韩江组",
            "开钻日期": "2010/3/6 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1551.2",
            "井况": "无显示井",
            "完钻日期": "2010/4/7 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.353355,
                19.8545246
            ]
        }
    },
    {
        "boid": "LW4-1-1",
        "bo": "LW4-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3431",
            "设计完钻层位": "恩平组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组，珠海组",
            "完钻深度": "3531",
            "完钻层位": "文昌组",
            "开钻日期": "2009/5/14 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1630.2",
            "井况": "油气层井",
            "完钻日期": "2009/6/7 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.553947,
                19.8466587
            ]
        }
    },
    {
        "boid": "LW4-3-1",
        "bo": "LW4-3-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3437.51",
            "设计完钻层位": "恩平组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3437",
            "完钻层位": "恩平组",
            "开钻日期": "2011/4/27 0:00:00",
            "作业方式": "合作（29/26）",
            "井型": "斜井",
            "井别": "预探井",
            "水深": "1654.96",
            "井况": "干井",
            "完钻日期": "2011/5/7 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.506721,
                19.8389511
            ]
        }
    },
    {
        "boid": "LW5-1-1",
        "bo": "LW5-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2831",
            "设计完钻层位": "前古近系",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "2720",
            "完钻层位": "前古近系",
            "开钻日期": "2011/8/17 0:00:00",
            "作业方式": "合作（29/26）",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1472.1",
            "井况": "显示井",
            "完钻日期": "2011/10/11 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.69149,
                19.9280319,
                null,
                null,
                null,
                null,
                null,
                null
            ]
        }
    },
    {
        "boid": "LW5-2-1",
        "bo": "LW5-2-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3481",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组",
            "完钻深度": "3481",
            "完钻层位": "珠江组",
            "开钻日期": "2010/5/28 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1349.84",
            "井况": "无显示井",
            "完钻日期": "2010/6/10 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.673164,
                20.0026379
            ]
        }
    },
    {
        "boid": "LW9-1-1",
        "bo": "LW9-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3678",
            "设计完钻层位": "前第三系",
            "目标区": "白云凹陷",
            "设计目的层": "珠海组、珠江组",
            "完钻深度": "3636",
            "完钻层位": "前古近系",
            "开钻日期": "2009/5/9 0:00:00",
            "作业方式": "合作(29/26)",
            "井型": "直井",
            "井别": "预探井",
            "水深": "1668.5",
            "井况": "油气层井",
            "完钻日期": "2009/7/2 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.417336,
                19.82825
            ]
        }
    },
    {
        "boid": "LW9-1-2",
        "bo": "LW9-1-2",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3731",
            "设计完钻层位": "珠海组",
            "目标区": "白云凹陷",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "3734",
            "完钻层位": "珠海组",
            "开钻日期": "2009/9/23 0:00:00",
            "作业方式": "合作",
            "井型": "直井",
            "井别": "评价井",
            "水深": "1634",
            "井况": "气层井",
            "完钻日期": "2009/12/18 0:00:00"
        },
        "location": {
            "type": "Point",
            "coordinates": [
                115.4407,
                19.841465
            ]
        }
    },
    {
        "boid": "PY10-11-1d",
        "bo": "PY10-11-1d",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "2900",
            "设计完钻层位": "珠海组",
            "目标区": "",
            "设计目的层": "下韩江组-珠江组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "定向井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.64093,
                20.79897
            ]
        }
    },
    {
        "boid": "PY28-1-1",
        "bo": "PY28-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3450",
            "设计完钻层位": "恩平组",
            "目标区": "",
            "设计目的层": "珠江组、珠海组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.4515,
                20.3464622
            ]
        }
    },
    {
        "boid": "XJ24-6-1",
        "bo": "XJ24-6-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4650",
            "设计完钻层位": "文昌组",
            "目标区": "",
            "设计目的层": "恩平组-下文昌组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.965675,
                21.4069786
            ]
        }
    },
    {
        "boid": "XJ26-1-1",
        "bo": "XJ26-1-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3300",
            "设计完钻层位": "古近系基底",
            "目标区": "",
            "设计目的层": "珠江组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.213272,
                21.1909885
            ]
        }
    },
    {
        "boid": "XJ33-1-3",
        "bo": "XJ33-1-3",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "4765",
            "设计完钻层位": "文一段",
            "目标区": "",
            "设计目的层": "珠江组、恩四段、文一段",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "评价井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.372292,
                21.0859985
            ]
        }
    },
    {
        "boid": "XJ34-4-1",
        "bo": "XJ34-4-1",
        "alias": [],
        "bot": "井",
        "properties": {
            "设计井深": "3675",
            "设计完钻层位": "前古近系基底",
            "目标区": "",
            "设计目的层": "恩平组、文昌组",
            "完钻深度": "",
            "完钻层位": "",
            "开钻日期": "",
            "作业方式": "",
            "井型": "直井",
            "井别": "预探井",
            "水深": "",
            "井况": "",
            "完钻日期": ""
        },
        "location": {
            "type": "Point",
            "coordinates": [
                114.464706,
                21.0675564
            ]
        }
    }
]