var $lang={
errAlertMsg: "Invalid date or the date out of range,redo or not?",
aWeekStr: ["недель", "Во", "По", "Вт", "Ср", "Че", "Пя", "Су"],
aLongWeekStr:["недель","воскрсенье","Понедельник","вторник","среда","четвёрг","пятница","суббота","воскрсенье"],
aMonStr: ["январь","февраль","март","апрель","май","июнь","июль","август","сентябрь","октябрь","ноябрь","декабрь"],
aLongMonStr: ["январь","февраль","март","апрель","май","июнь","июль","август","сентябрь","октябрь","ноябрь","декабрь"],
clearStr: "Очистить",
todayStr: "Днес",
okStr: "Добре",
updateStr: "Добре",
timeStr: "время",
quickStr: "Быстрый выбор",
err_1: 'MinDate Cannot be bigger than MaxDate!'
};